tap "aurc/loggo"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
brew "act"
brew "m4"
brew "autoconf"
brew "coreutils"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "awscli"
brew "bash"
brew "binutils"
brew "cookiecutter"
brew "cruft"
brew "difftastic"
brew "diffutils"
brew "docker"
brew "docutils"
brew "ed"
brew "fd"
brew "findutils"
brew "flex"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gpatch"
brew "gradle"
brew "grep"
brew "gron"
brew "gzip"
brew "jless"
brew "jnv"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "less"
brew "lf"
brew "libxkbcommon"
brew "make"
brew "nano"
brew "openshift-cli"
brew "openssl@1.1"
brew "poetry"
brew "ripgrep"
brew "sbt"
brew "screen"
brew "shellcheck"
brew "snappy"
brew "stow"
brew "tmux"
brew "tree"
brew "watch"
brew "watchexec"
brew "wdiff"
brew "wget"
brew "yamllint"
brew "yq"
brew "zip"
brew "aurc/loggo/loggo"
brew "derailed/k9s/k9s"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
cask "alfred"
cask "alt-tab"
cask "another-redis-desktop-manager"
cask "betterdisplay"
cask "brave-browser"
cask "dbeaver-community"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "gpg-suite"
cask "hammerspoon"
cask "hyperkey"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "iterm2"
cask "keycastr"
cask "postman"
cask "redisinsight"
cask "utc-menu-clock"
