tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "aurc/loggo"
tap "datadog-labs/pack"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "oven-sh/bun"
# Run your GitHub Actions locally
brew "act"
# General-purpose data compression with high compression ratio
brew "xz"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU binary tools for native development
brew "binutils"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Utility that creates projects from templates and maintains the cruft afterwards
brew "cruft"
# Command-line csv viewer
brew "csvlens"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Classic UNIX line editor
brew "ed"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Asynchronous event library
brew "libevent"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Compression/decompression library aiming for high speed
brew "snappy"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# CLI for making updates across multiple Github repositories with a single command
brew "git-xargs"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Apply a diff file to an original
brew "gpatch"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# Popular GNU data compression program
brew "gzip"
# JSON diff and patch
brew "jd"
# Command-line pager for JSON data
brew "jless"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Pager program similar to more
brew "less"
# Terminal file manager
brew "lf"
# Graphics Library
brew "mesa"
# Keyboard handling library
brew "libxkbcommon"
# Utility for directing compilation
brew "make"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# OpenShift command-line interface tools
brew "openshift-cli"
# Shell command parallelization utility
brew "parallel"
# Python package management tool
brew "poetry"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Build tool for Scala projects
brew "sbt"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terminal based presentation tool
brew "slides"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Compression and file packaging/archive utility
brew "zip"
# General-purpose lossless data-compression library
brew "zlib"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Application launcher and productivity software
cask "alfred"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-fira-code-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono"
# Tools to protect your emails and files
cask "gpg-suite"
# Desktop automation application
cask "hammerspoon"
# Speech to text application
cask "handy"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# HTTP and GraphQL Client
cask "insomnium"
# Java IDE by JetBrains
cask "intellij-idea"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
# Collaboration platform for API development
cask "postman"
# GUI for streamlined Redis application development
cask "redis-insight"
# Team communication and collaboration software
cask "slack"
# Menu bar clock
cask "utc-menu-clock"
uv "posting"
npm "corepack"
